var MESSAGEERR = {
	LOGI0001: 'LOGI0001: 로그인되지 않았습니다.',
	LOGI0002: 'LOGI0002: 다시 로그인 해주세요.',

	SERV0001: 'SERV0001: 서버 오류입니다.',

	REQU0001: 'REQU0001: 서버세션이 초기화 되었습니다. 편집기를 재시작해주세요.',
	REQU0002: 'REQU0002: 잘못된 요청이거나 서버에서 지원하지 않는 기능입니다.',

	UPLO0001: 'UPLO0001: 파일 전송 중 오류가 발생했습니다.',
	UPLO0002: 'UPLO0002: 서버 처리 중 오류가 발생했습니다.',
	UPLO0003: 'UPLO0003: 서버 처리 중 오류가 발생했습니다.',

	FILE0001: 'FILE0001: 서버 파일경로를 찾을 수 없습니다.',

	IMAG0001: 'IMAG0001: 서버 처리 중 오류가 발생했습니다.',
	IMAG0002: 'IMAG0002: 서버 처리 중 오류가 발생했습니다.',
	IMAG0003: 'IMAG0003: 서버 처리 중 오류가 발생했습니다.',
	IMAG0004: 'IMAG0004: 사용자 허용 용량을 초과합니다.',
	IMAG0005: 'IMAG0005: 중복된 파일명이 존재합니다.',

	MEDI0001: 'MEDI0001: 서버 처리 중 오류가 발생했습니다.',
	MEDI0002: 'MEDI0002: 서버 처리 중 오류가 발생했습니다.',
	MEDI0003: 'MEDI0003: 서버 처리 중 오류가 발생했습니다.',
	MEDI0004: 'MEDI0004: 사용자 허용 용량을 초과합니다.',
	MEDI0005: 'MEDI0005: 중복된 파일명이 존재합니다.',

	DOCU0001: 'DOCU0001: 서버 처리 중 오류가 발생했습니다.',
	DOCU0002: 'DOCU0002: 서버 처리 중 오류가 발생했습니다.',
	DOCU0003: 'DOCU0003: 이미 사용 중인 ID 입니다.',
	DOCU0004: 'DOCU0004: 서버 처리 중 오류가 발생했습니다.',
	DOCU0005: 'DOCU0005: 서버 처리 중 오류가 발생했습니다.',
	DOCU0006: 'DOCU0006: 서버 처리 중 오류가 발생했습니다.',
	DOCU0007: 'DOCU0007: 데이터가 존재하지 않습니다.',
	DOCU0008: 'DOCU0008: 서버 처리 중 오류가 발생했습니다.',
	DOCU0009: 'DOCU0009: 서버 처리 중 오류가 발생했습니다.',
	DOCU0010: 'DOCU0010: 사용자 허용 용량을 초과합니다.',

	DOPU0001: 'DOPU0001: 서버 처리 중 오류가 발생했습니다.',
	DOPU0002: 'DOPU0002: 서버 처리 중 오류가 발생했습니다.',
	DOPU0003: 'DOPU0003: 서버 처리 중 오류가 발생했습니다.',
	DOPU0004: 'DOPU0004: 서버 처리 중 오류가 발생했습니다.',
	DOPU0005: 'DOPU0005: 서버 처리 중 오류가 발생했습니다.',
	DOPU0006: 'DOPU0006: 서버 처리 중 오류가 발생했습니다.',
	DOPU0007: 'DOPU0007: 서버 처리 중 오류가 발생했습니다.',
	DOPU0008: 'DOPU0008: 서버 처리 중 오류가 발생했습니다.',
	DOPU0009: 'DOPU0009: 서버 처리 중 오류가 발생했습니다.',
	DOPU0010: 'DOPU0010: 서버 처리 중 오류가 발생했습니다.',
	DOPU0011: 'DOPU0011: 서버 처리 중 오류가 발생했습니다.',
	DOPU0012: 'DOPU0012: 서버 처리 중 오류가 발생했습니다.',
	DOPU0013: 'DOPU0013: 서버 처리 중 오류가 발생했습니다.',
	DOPU0014: 'DOPU0013: 서버 처리 중 오류가 발생했습니다.',

};